# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# Series

In [3]:
s1 = pd.Series([1, 3, 5, np.nan, 6, 8])
s1

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
s1.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
s1.values

array([ 1.,  3.,  5., nan,  6.,  8.])

#### numpy 배열을 사용하지만 object타입으로 이용할 경우 배열의 모든 원소의 데이터 타입이 달라도 됨.

In [6]:
s1 = pd.Series([np.nan, np.inf, 0, 1, 2, 3, 'a', 'b', 'c'])
s1

0    NaN
1    inf
2      0
3      1
4      2
5      3
6      a
7      b
8      c
dtype: object

In [7]:
s1.values

array([nan, inf, 0, 1, 2, 3, 'a', 'b', 'c'], dtype=object)

## index 설정하기

In [9]:
index_seq = range(10, 20)
seq_data = range(10)
s2 = pd.Series(data=seq_data, index=index_seq)
s2

10    0
11    1
12    2
13    3
14    4
15    5
16    6
17    7
18    8
19    9
dtype: int64

In [10]:
index_date = ['2018-10-17', '2018-10-18', '2018-10-19', '2018-10-20']
s3 = pd.Series([200, 195, np.nan, 205], index=index_date)
s3

2018-10-17    200.0
2018-10-18    195.0
2018-10-19      NaN
2018-10-20    205.0
dtype: float64

In [11]:
s3.index

Index(['2018-10-17', '2018-10-18', '2018-10-19', '2018-10-20'], dtype='object')

## 데이터 연산

In [13]:
s1 = pd.Series((range(10, 70, 10)))
s2 = pd.Series((range(1, 6)))

print(repr(s1))
print(repr(s2))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
s1+s2

0    11.0
1    22.0
2    33.0
3    44.0
4    55.0
5     NaN
dtype: float64

In [15]:
s1-s2

0     9.0
1    18.0
2    27.0
3    36.0
4    45.0
5     NaN
dtype: float64

In [16]:
s1*s2

0     10.0
1     40.0
2     90.0
3    160.0
4    250.0
5      NaN
dtype: float64

In [17]:
s1/s2

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
5     NaN
dtype: float64

In [18]:
s1**s2

0           10.0
1          400.0
2        27000.0
3      2560000.0
4    312500000.0
5            NaN
dtype: float64

In [19]:
s1//s2

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
5     NaN
dtype: float64

In [20]:
s1%s2

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
5    NaN
dtype: float64

## Dictionary로 시리즈 입력

In [12]:
# key->index, value->value
dict_data = {
    '국어': 100,
    '영어': 95,
    '수학': 80
}
s5 = pd.Series(dict_data)
print(s5)

국어    100
영어     95
수학     80
dtype: int64

## 날짜 자동 생성 - date_range

In [21]:
pd.date_range('2019-05-25', '2019-05-28')

DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

In [22]:
pd.date_range(start='2019-05-25', end='2019-05-28')

DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

In [23]:
pd.date_range(start='2019-05-25', periods=4)

DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

In [24]:
pd.date_range(start='2019-05-25 10:00:00', periods=6)

DatetimeIndex(['2019-05-25 10:00:00', '2019-05-26 10:00:00',
               '2019-05-27 10:00:00', '2019-05-28 10:00:00',
               '2019-05-29 10:00:00', '2019-05-30 10:00:00'],
              dtype='datetime64[ns]', freq='D')

### 날짜 데이터 포맷 (yyyy-mm-dd)

In [34]:
date_index1 = pd.date_range(start='2019-05-25', periods=4)
date_index2 = pd.date_range(start='2019.05.25', periods=4)
date_index3 = pd.date_range(start='2019/05/25', periods=4)
print('date_index1: ', repr(date_index1))
print('date_index2: ', repr(date_index2))
print('date_index3: ', repr(date_index3))

date_index1:  DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
date_index2:  DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
date_index3:  DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

In [35]:
pd.date_range

In [36]:
date_index4 = pd.date_range(start='05/25/2019', periods=4)
date_index5 = pd.date_range(start='05-25-2019', periods=4)
date_index6 = pd.date_range(start='05.25.2019', periods=4)

print('date_index4: ', repr(date_index4))
print('date_index5: ', repr(date_index5))
print('date_index6: ', repr(date_index6))

date_index4:  DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
date_index5:  DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')
date_index6:  DatetimeIndex(['2019-05-25', '2019-05-26', '2019-05-27', '2019-05-28'], dtype='datetime64[ns]', freq='D')

### date_range's  time series Frequencies

In [37]:
# 2 day
pd.date_range(start="2019-05-25", periods=8, freq='2D')

DatetimeIndex(['2019-05-25', '2019-05-27', '2019-05-29', '2019-05-31',
               '2019-06-02', '2019-06-04', '2019-06-06', '2019-06-08'],
              dtype='datetime64[ns]', freq='2D')

In [38]:
# business day
pd.date_range(start="2019-05-25", periods=8, freq='B')

DatetimeIndex(['2019-05-27', '2019-05-28', '2019-05-29', '2019-05-30',
               '2019-05-31', '2019-06-03', '2019-06-04', '2019-06-05'],
              dtype='datetime64[ns]', freq='B')

In [39]:
# 3 week
pd.date_range(start="2019-05-25", periods=8, freq='3W')

DatetimeIndex(['2019-05-26', '2019-06-16', '2019-07-07', '2019-07-28',
               '2019-08-18', '2019-09-08', '2019-09-29', '2019-10-20'],
              dtype='datetime64[ns]', freq='3W-SUN')

In [40]:
# 월말 Month Last
pd.date_range(start="2019-05-25", periods=8, freq='M')

DatetimeIndex(['2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31'],
              dtype='datetime64[ns]', freq='M')

In [41]:
# Buisness Month
pd.date_range(start="2019-05-25", periods=8, freq='BM')

DatetimeIndex(['2019-05-31', '2019-06-28', '2019-07-31', '2019-08-30',
               '2019-09-30', '2019-10-31', '2019-11-29', '2019-12-31'],
              dtype='datetime64[ns]', freq='BM')

In [42]:
# Buisness Month Start
pd.date_range(start="2019-05-25", periods=8, freq='BMS')

DatetimeIndex(['2019-06-03', '2019-07-01', '2019-08-01', '2019-09-02',
               '2019-10-01', '2019-11-01', '2019-12-02', '2020-01-01'],
              dtype='datetime64[ns]', freq='BMS')

In [43]:
# Quarter
pd.date_range(start="2019-05-25", periods=8, freq='Q')

DatetimeIndex(['2019-06-30', '2019-09-30', '2019-12-31', '2020-03-31',
               '2020-06-30', '2020-09-30', '2020-12-31', '2021-03-31'],
              dtype='datetime64[ns]', freq='Q-DEC')

In [44]:
# Year
pd.date_range(start="2019-05-25 10:10", periods=8, freq='A')

DatetimeIndex(['2019-12-31 10:10:00', '2020-12-31 10:10:00',
               '2021-12-31 10:10:00', '2022-12-31 10:10:00',
               '2023-12-31 10:10:00', '2024-12-31 10:10:00',
               '2025-12-31 10:10:00', '2026-12-31 10:10:00'],
              dtype='datetime64[ns]', freq='A-DEC')

In [45]:
# Hour
pd.date_range(start="2019-05-25 10:10", periods=8, freq='H')

DatetimeIndex(['2019-05-25 10:10:00', '2019-05-25 11:10:00',
               '2019-05-25 12:10:00', '2019-05-25 13:10:00',
               '2019-05-25 14:10:00', '2019-05-25 15:10:00',
               '2019-05-25 16:10:00', '2019-05-25 17:10:00'],
              dtype='datetime64[ns]', freq='H')

In [46]:
# Minutes

pd.date_range(start="2019-05-25 10:10", periods=8, freq='min')
# pd.date_range(start="2019-05-25 10:10", periods=8, freq='T')

DatetimeIndex(['2019-05-25 10:10:00', '2019-05-25 10:11:00',
               '2019-05-25 10:12:00', '2019-05-25 10:13:00',
               '2019-05-25 10:14:00', '2019-05-25 10:15:00',
               '2019-05-25 10:16:00', '2019-05-25 10:17:00'],
              dtype='datetime64[ns]', freq='T')

In [47]:
# Seconds

pd.date_range(start="2019-05-25 10:10", periods=8, freq='10S')

DatetimeIndex(['2019-05-25 10:10:00', '2019-05-25 10:10:10',
               '2019-05-25 10:10:20', '2019-05-25 10:10:30',
               '2019-05-25 10:10:40', '2019-05-25 10:10:50',
               '2019-05-25 10:11:00', '2019-05-25 10:11:10'],
              dtype='datetime64[ns]', freq='10S')

# DataFrame

Series는 1차원 데이터  
2차원 데이터 처리 필요 (Excel)  => DataFrame

In [48]:
df = pd.DataFrame([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
df

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [49]:
type(df)

pandas.core.frame.DataFrame

In [50]:
np_array = np.arange(10,100,10).reshape(3,3)
df1 = pd.DataFrame(np_array)
df1

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

## index와 column

In [51]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [52]:
# index 지정
df1.index = pd.date_range('2019-05-05', periods=3)
df1

             0   1   2
2019-05-05  10  20  30
2019-05-06  40  50  60
2019-05-07  70  80  90

In [53]:
df1.index

DatetimeIndex(['2019-05-05', '2019-05-06', '2019-05-07'], dtype='datetime64[ns]', freq='D')

In [54]:
# column 지정
df1.columns = ['A', 'B', 'C']
df1

             A   B   C
2019-05-05  10  20  30
2019-05-06  40  50  60
2019-05-07  70  80  90

In [55]:
# 초기화시 인자 전달
df2 = pd.DataFrame(np.arange(10, 100, 10).reshape(3,3), 
                  index=pd.date_range('2019-03-05', periods=3, freq='M'), 
                  columns=['A', 'B', 'C'])
df2

             A   B   C
2019-03-31  10  20  30
2019-04-30  40  50  60
2019-05-31  70  80  90

## 딕셔너리로 DataFrame 만들기

In [56]:
table_data = {'연도':list(range(2010, 2020)),
              '매출액': [v**2 for i, v in enumerate(range(1,11))],
              '종업원 수': list(range(2, 30, 3))}


df = pd.DataFrame(table_data)
df

     연도  매출액  종업원 수
0  2010    1      2
1  2011    4      5
2  2012    9      8
3  2013   16     11
4  2014   25     14
5  2015   36     17
6  2016   49     20
7  2017   64     23
8  2018   81     26
9  2019  100     29

## Head & tail

In [57]:
df.head()

     연도  매출액  종업원 수
0  2010    1      2
1  2011    4      5
2  2012    9      8
3  2013   16     11
4  2014   25     14

In [58]:
df.head(3)

     연도  매출액  종업원 수
0  2010    1      2
1  2011    4      5
2  2012    9      8

In [59]:
df.tail()

     연도  매출액  종업원 수
5  2015   36     17
6  2016   49     20
7  2017   64     23
8  2018   81     26
9  2019  100     29

In [60]:
df.tail(3)

     연도  매출액  종업원 수
7  2017   64     23
8  2018   81     26
9  2019  100     29

### index, columns, values

In [61]:
df

     연도  매출액  종업원 수
0  2010    1      2
1  2011    4      5
2  2012    9      8
3  2013   16     11
4  2014   25     14
5  2015   36     17
6  2016   49     20
7  2017   64     23
8  2018   81     26
9  2019  100     29

In [62]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [63]:
df.columns

Index(['연도', '매출액', '종업원 수'], dtype='object')

In [64]:
df.values

array([[2010,    1,    2],
       [2011,    4,    5],
       [2012,    9,    8],
       [2013,   16,   11],
       [2014,   25,   14],
       [2015,   36,   17],
       [2016,   49,   20],
       [2017,   64,   23],
       [2018,   81,   26],
       [2019,  100,   29]], dtype=int64)

## 데이터 연산

In [65]:
table_data1 = {
    'A': np.arange(1, 6),
    'B': np.arange(10, 60, 10),
    'C': np.arange(100, 600, 100),
}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [66]:
table_data2 = {
    'A': [6, 7, 8],
    'B': [60, 70, 80],
    'C': [600, 700, 800],
}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [67]:
# 덧셈
df1+df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [68]:
# 뺄셈
df1-df2

     A     B      C
0 -5.0 -50.0 -500.0
1 -5.0 -50.0 -500.0
2 -5.0 -50.0 -500.0
3  NaN   NaN    NaN
4  NaN   NaN    NaN

In [69]:
df1*df2

      A       B         C
0   6.0   600.0   60000.0
1  14.0  1400.0  140000.0
2  24.0  2400.0  240000.0
3   NaN     NaN       NaN
4   NaN     NaN       NaN

In [70]:
df1/df2

          A         B         C
0  0.166667  0.166667  0.166667
1  0.285714  0.285714  0.285714
2  0.375000  0.375000  0.375000
3       NaN       NaN       NaN
4       NaN       NaN       NaN

In [71]:
df1**df2

        A              B    C
0     1.0   1.000000e+60  inf
1   128.0   1.180592e+91  inf
2  6561.0  1.478088e+118  inf
3     NaN            NaN  NaN
4     NaN            NaN  NaN

In [72]:
df1%df2

     A     B      C
0  1.0  10.0  100.0
1  2.0  20.0  200.0
2  3.0  30.0  300.0
3  NaN   NaN    NaN
4  NaN   NaN    NaN

## 통계분석을 위한 method

In [74]:
df1 = pd.DataFrame({'봄': [256.5, 264.3, 215.9, 223.2, 312.8],
                    '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
                    '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
                    '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]},
                    index=['2012', '2013', '2014', '2015', '2016'])
df1

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

### sum / mean

In [75]:
df1.sum()

봄     1272.7
여름    2771.2
가을    1517.1
겨울     493.3
dtype: float64

In [76]:
df1.sum(axis=1)

2012    1529.9
2013    1122.9
2014    1185.7
2015     967.1
2016    1248.7
dtype: float64

In [77]:
df1.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [78]:
df1.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

### min / max

In [79]:
df1.min()

봄     215.9
여름    387.1
가을    231.2
겨울     59.9
dtype: float64

In [80]:
df1.min(axis=1)

2012    139.3
2013     59.9
2014     76.9
2015    109.1
2016    108.1
dtype: float64

In [81]:
df1.max()

봄     312.8
여름    770.6
가을    381.6
겨울    139.3
dtype: float64

In [82]:
df1.max(axis=1)

2012    770.6
2013    567.5
2014    599.8
2015    387.1
2016    446.2
dtype: float64

### std / var

In [83]:
df1.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [84]:
df1.std(axis=1)

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [85]:
df1.var()

봄      1492.143
여름    22167.903
가을     4537.167
겨울      956.388
dtype: float64

In [86]:
df1.var(axis=1)

2012    75334.949167
2013    44575.362500
2014    48907.649167
2015    13034.049167
2016    21476.509167
dtype: float64

### cumsum / cumprod

In [87]:
df1.cumsum()

           봄      여름      가을     겨울
2012   256.5   770.6   363.5  139.3
2013   520.8  1338.1   594.7  199.2
2014   736.7  1937.9   887.8  276.1
2015   959.9  2325.0  1135.5  385.2
2016  1272.7  2771.2  1517.1  493.3

In [88]:
df1.cumsum(axis=1)

          봄      여름      가을      겨울
2012  256.5  1027.1  1390.6  1529.9
2013  264.3   831.8  1063.0  1122.9
2014  215.9   815.7  1108.8  1185.7
2015  223.2   610.3   858.0   967.1
2016  312.8   759.0  1140.6  1248.7

In [89]:
df1.cumprod()

                 봄            여름            가을            겨울
2012  2.565000e+02  7.706000e+02  3.635000e+02  1.393000e+02
2013  6.779295e+04  4.373155e+05  8.404120e+04  8.344070e+03
2014  1.463650e+07  2.623018e+08  2.463248e+07  6.416590e+05
2015  3.266866e+09  1.015370e+11  6.101464e+09  7.000500e+07
2016  1.021876e+12  4.530583e+13  2.328319e+12  7.567540e+09

In [90]:
df1.cumprod(axis=1)

          봄         여름            가을            겨울
2012  256.5  197658.90  7.184901e+07  1.000857e+10
2013  264.3  149990.25  3.467775e+07  2.077197e+09
2014  215.9  129496.82  3.795552e+07  2.918779e+09
2015  223.2   86400.72  2.140146e+07  2.334899e+09
2016  312.8  139571.36  5.326043e+07  5.757453e+09

### describe()

In [94]:
df1.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
연도       10 non-null int64
매출액      10 non-null int64
종업원 수    10 non-null int64
dtypes: int64(3)
memory usage: 320.0 bytes

## 인덱싱, 슬라이싱

In [96]:
df1

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

### Column으로 접근

In [97]:
df1['봄']

2012    256.5
2013    264.3
2014    215.9
2015    223.2
2016    312.8
Name: 봄, dtype: float64

In [98]:
df1['여름']

2012    770.6
2013    567.5
2014    599.8
2015    387.1
2016    446.2
Name: 여름, dtype: float64

### Row로 접근

In [99]:
df1[1:3]

          봄     여름     가을    겨울
2013  264.3  567.5  231.2  59.9
2014  215.9  599.8  293.1  76.9

In [100]:
df1[:2]

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9

In [101]:
df1[:'2013']

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9

In [103]:
df1.loc['2013']

봄     264.3
여름    567.5
가을    231.2
겨울     59.9
Name: 2013, dtype: float64

In [104]:
df1.loc['2013']

봄     264.3
여름    567.5
가을    231.2
겨울     59.9
Name: 2013, dtype: float64

In [105]:
df1.loc['2013':'2016']

          봄     여름     가을     겨울
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

### 결합

In [106]:
df1['봄'][:3]

2012    256.5
2013    264.3
2014    215.9
Name: 봄, dtype: float64

In [107]:
df1['여름'][:'2014']

2012    770.6
2013    567.5
2014    599.8
Name: 여름, dtype: float64

In [108]:
df1.loc['2013':, '봄':]

          봄     여름     가을     겨울
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [109]:
df1.loc['2016']

봄     312.8
여름    446.2
가을    381.6
겨울    108.1
Name: 2016, dtype: float64

### 데이터프레임 전치

In [110]:
df1

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [111]:
df1.T

     2012   2013   2014   2015   2016
봄   256.5  264.3  215.9  223.2  312.8
여름  770.6  567.5  599.8  387.1  446.2
가을  363.5  231.2  293.1  247.7  381.6
겨울  139.3   59.9   76.9  109.1  108.1

### 열 순서 변경

In [112]:
df1

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [113]:
df1[['겨울', '봄', '여름', '가을']]

         겨울      봄     여름     가을
2012  139.3  256.5  770.6  363.5
2013   59.9  264.3  567.5  231.2
2014   76.9  215.9  599.8  293.1
2015  109.1  223.2  387.1  247.7
2016  108.1  312.8  446.2  381.6

### 행 변경

In [114]:
df1.loc[['2016', '2015', '2014']]

          봄     여름     가을     겨울
2016  312.8  446.2  381.6  108.1
2015  223.2  387.1  247.7  109.1
2014  215.9  599.8  293.1   76.9

In [115]:
df2 = pd.DataFrame({
    '봄': [302.9, 256.9],
    '여름': [692.6, 1053.6],
    '가을': [307.6, 225.5],
    '겨울': [98.7, 45.6]},
    index=[2010,2011]
)
df2

          봄      여름     가을    겨울
2010  302.9   692.6  307.6  98.7
2011  256.9  1053.6  225.5  45.6

## 데이터 통합하기

In [116]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 98, 100]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100

In [117]:
df2 = pd.DataFrame({'Class1': [76, 88],
                    'Class2': [100, 100]})
df2

   Class1  Class2
0      76     100
1      88     100

### 세로방향 통합

In [118]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100
0      76     100
1      88     100

In [119]:
# index 무시
df1.append(df2, ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100
4      76     100
5      88     100

In [123]:
df1.append(df2).reset_index(drop=True)

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100
4      76     100
5      88     100

#### 컬럼이 다 다를때

In [124]:
df3 = pd.DataFrame({'Class1': [80,10], 'Class3': [50, 60]})
df3

   Class1  Class3
0      80      50
1      10      60

In [126]:
df1.append(df3, ignore_index=True, sort=True)

   Class1  Class2  Class3
0      95    91.0     NaN
1      92    93.0     NaN
2      98    98.0     NaN
3     100   100.0     NaN
4      80     NaN    50.0
5      10     NaN    60.0

### 가로방향 통합하기

In [127]:
df1

   Class1  Class2
0      95      91
1      92      93
2      98      98
3     100     100

In [128]:
df4 = pd.DataFrame({'Class3': [92,93,94,91,99]})
df4

   Class3
0      92
1      93
2      94
3      91
4      99

In [131]:
df1.join(df4, how="inner")

   Class1  Class2  Class3
0      95      91      92
1      92      93      93
2      98      98      94
3     100     100      91

In [132]:
df1.join(df4, how="outer")

   Class1  Class2  Class3
0    95.0    91.0      92
1    92.0    93.0      93
2    98.0    98.0      94
3   100.0   100.0      91
4     NaN     NaN      99

In [133]:
df1.join(df4, how="left")

   Class1  Class2  Class3
0      95      91      92
1      92      93      93
2      98      98      94
3     100     100      91

In [134]:
df1.join(df4, how="right")

   Class1  Class2  Class3
0    95.0    91.0      92
1    92.0    93.0      93
2    98.0    98.0      94
3   100.0   100.0      91
4     NaN     NaN      99

#### index 지정시

In [ ]:
df1

In [ ]:
df1.index = ['a', 'b', 'c', 'd']
df1

In [ ]:
df4

In [ ]:
df4.index = list('abcde')
df4

In [ ]:
df1.join(df4)

In [ ]:
df4.join(df1)

### 특정 열을 기준으로 통합하기

In [135]:
import random
month_list = [str(i)+'월' for i in range(1,5)]

prod_A, prod_B, prod_C, prod_D = [np.random.randint(50, 100, size=4) for i in range(4)]


df_A_B = pd.DataFrame({'판매월': month_list, 
                       '제품A': prod_A,
                       '제품B': prod_B})
df_A_B

  판매월  제품A  제품B
0  1월   95   67
1  2월   79   97
2  3월   52   55
3  4월   76   55

In [136]:
df_C_D = pd.DataFrame({'판매월': month_list,
                       '제품C': prod_C,
                       '제품D': prod_D})
df_C_D

  판매월  제품C  제품D
0  1월   60   79
1  2월   58   81
2  3월   52   91
3  4월   81   97

### merge

In [137]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월   95   67   60   79
1  2월   79   97   58   81
2  3월   52   55   52   91
3  4월   76   55   81   97

#### mefge - how

In [138]:
df_A_B

  판매월  제품A  제품B
0  1월   95   67
1  2월   79   97
2  3월   52   55
3  4월   76   55

In [139]:
prod_E, prod_F = [np.random.randint(50, 100, size=4) for i in range(2)]
df_E_F = pd.DataFrame({'판매월': ['3월', '4월', '5월', '6월'],
                       '제품E': prod_E,
                       '제품F': prod_F})
df_E_F

  판매월  제품E  제품F
0  3월   65   66
1  4월   91   73
2  5월   92   98
3  6월   95   96

In [140]:
df_A_B.merge(df_E_F, how='left')

  판매월  제품A  제품B   제품E   제품F
0  1월   95   67   NaN   NaN
1  2월   79   97   NaN   NaN
2  3월   52   55  65.0  66.0
3  4월   76   55  91.0  73.0

In [141]:
df_A_B.merge(df_E_F, how='right')

  판매월   제품A   제품B  제품E  제품F
0  3월  52.0  55.0   65   66
1  4월  76.0  55.0   91   73
2  5월   NaN   NaN   92   98
3  6월   NaN   NaN   95   96

In [142]:
df_A_B.merge(df_E_F, how='inner')

  판매월  제품A  제품B  제품E  제품F
0  3월   52   55   65   66
1  4월   76   55   91   73

In [143]:
df_A_B.merge(df_E_F, how='outer')

  판매월   제품A   제품B   제품E   제품F
0  1월  95.0  67.0   NaN   NaN
1  2월  79.0  97.0   NaN   NaN
2  3월  52.0  55.0  65.0  66.0
3  4월  76.0  55.0  91.0  73.0
4  5월   NaN   NaN  92.0  98.0
5  6월   NaN   NaN  95.0  96.0

In [144]:
df_A_B.merge(df_E_F, how='outer', on="판매월")

  판매월   제품A   제품B   제품E   제품F
0  1월  95.0  67.0   NaN   NaN
1  2월  79.0  97.0   NaN   NaN
2  3월  52.0  55.0  65.0  66.0
3  4월  76.0  55.0  91.0  73.0
4  5월   NaN   NaN  92.0  98.0
5  6월   NaN   NaN  95.0  96.0

In [147]:
# df_A_B.join(df_E_F)

# 데이터 파일 읽고 쓰기

## CSV 파일

In [154]:
import os
BASE_DIR = os.getcwd()
DATASET_PATH = os.path.join(BASE_DIR, "datasets\\201904")
print(DATASET_PATH)

C:\Users\student\Desktop\multicampus_lecture\datasets\201904

In [163]:
file1 = os.path.join(DATASET_PATH, "2019-04-30.csv")
df = pd.read_csv(file1, error_bad_lines=False, header=None)
df

b'Skipping line 18081: expected 8 fields, saw 11\n'

,0,1,2,3,4,5,6,7
0,2019-04-30,1545587997,C013010,점퍼,캘빈클라인진 19SS 신상 여성 항공점퍼 J211287,99500,NaN,NaN
1,2019-04-30,147567876,C013020,티셔츠,[모다아울렛][티엔지티]그레이 라운드넥 면 긴팔티셔츠TGTS9A103G2,55200,NaN,NaN
2,2019-04-30,897756527,A011060,땅콩,간단한 맥주안주 마른 군것질 견과 꿀땅콩 453g 간단,10970,NaN,NaN
3,2019-04-30,410494691,A019050,간장,간장(진 사조 옹가네 1.8L)X8 간장 진간장 식자재 업,36870,NaN,NaN
4,2019-04-30,223173815,C011020,남자상의,(색상 : 곤색 | 사이즈 : XL) FSSF18036 선염체크 버튼다운 남방 남자...,41070,NaN,NaN
5,2019-04-30,1173935366,A019180,즉석식품,(냉동)금호 쌀떡꼬치900g(10p)x15개(1box) 쌀떡꼬치 튀김류 떡꼬치 가공...,89160,NaN,NaN
6,2019-04-30,1476779724,C012050,여자하의,[빨질레리] 애쉬 울 블렌드 시어서커 셋업 팬츠 (PC9121UA14),181300,NaN,NaN
7,2019-04-30,1847125407,C014010,아동복,[압소바]라글랑화섬점퍼 AU3-53103,71200,NaN,NaN
8,2019-04-30,765016470,C012030,여자상의,[에스쏠레지아] 봄의 요정이 살포시 앉은 레이스와 프릴 블라우스_NC엑스코점,179000,NaN,NaN
9,2019-04-30,1093348192,E061060,살충제,[한국디비케이(주)] 킬파프 개미에어졸 뿌리는개미살충제 스프레이개미약,6350,NaN,NaN
10,2019-04-30,2116113448,C012050,여자하의,반에이크 ㄷ밑단커팅면바지 VA93DLM203Z,39800,NaN,NaN
11,2019-04-30,614125763,C013060,등산복,(옵션-사이즈 : K2 방한장갑 IMW12901-M) K2 방한장갑 IMW12901...,47000,NaN,NaN
12,2019-04-30,42902822,C011040,남자하의,[지오지아] 면혼방 프린트 하프팬츠 ABV2PH1105WT/ 지오지아,9000,NaN,NaN
13,2019-04-30,214930055,C013020,티셔츠,[세바스찬골프] 상하 반전 배색 스판 남성 카라넥 반팔티셔츠_243813,37905,37905.0,0.0
14,2019-04-30,384202521,I012050,컴퓨터소모품,[HP] 잉크 C8775WA (No.02/S라이트마젠타),18000,18000.0,0.0
15,2019-04-30,1146020498,C013020,티셔츠,(옵션1 : 블랙-XL) 810 데일리 폴링 반폴라티 DGO3295 여성빅사이즈티셔...,23000,NaN,NaN
16,2019-04-30,355123645,C013020,티셔츠,흡한속건 소매 메쉬 여성 하프넥 반팔티셔츠/골프웨어_244317,43130,43130.0,0.0
17,2019-04-30,721037017,L012110,색조화장품,[MAC]맥 플렌티 오브 파우트 플럼핑 립스틱[갤러리아],34000,NaN,NaN
18,2019-04-30,233236126,C014010,아동복,(색상 : 네이비5호) 아동원피스 벨트 원피스 KIDBOK-266 여아원피스 유아의...,20170,NaN,NaN
19,2019-04-30,1295113329,C011020,남자상의,[하프클럽/ZIOZIA](지오지아) 면혼방 체크 드레스셔츠 ABV1WC1103YE,6000,NaN,NaN
20,2019-04-30,1887159474,C012050,여자하의,[나이스크랍][AK구로점][나이스클랍] [18년 겨울]레오파드 스커트 N184PWKB99,219000,NaN,NaN
21,2019-04-30,619083649,C012050,여자하의,[반에이크]반에이크 블랙 베이직 큐롯팬츠 VA95SLQ304Z (VA95SLQ304Z),39800,NaN,NaN
22,2019-04-30,2140496746,C013020,티셔츠,[파파브로]남자 국산 스판 카라 패턴 티셔츠 LM-A9-253-그레이,29800,NaN,NaN
23,2019-04-30,129170450,C014010,아동복,[오렌지앤] 라임향품은코트_S-2XL(OJK73267),79200,NaN,NaN
24,2019-04-30,917251725,A021020,차,다미즐 제주 청귤차 1kg,7000,6820.0,-180.0
25,2019-04-30,1723482670,C021030,운동화,[나이키] (SIZE : 260) 에어 줌 페가수스 35(942851101) 런닝운...,153740,NaN,NaN
26,2019-04-30,343414417,C012010,여자외의,[하프클럽/매긴]양가죽숏라이더자켓MHDLJ101,198000,NaN,NaN
27,2019-04-30,1485277833,C012010,여자외의,[진도 Klever] 로얄 세이블 콤비 유색 밍크 코트(K2W3EC53_),4590000,NaN,NaN
28,2019-04-30,287212559,C013020,티셔츠,(색상 : 다홍 | 사이즈 : 110(2XL)) MTSS18095 숄더앤 바스트 포...,36270,NaN,NaN
29,2019-04-30,1973646101,C013060,등산복,(옵션 : 105(2XL)) 랜더스 라이트 폴라폴리스 자켓(JK430W) 블루 폴라...,34140,NaN,NaN
...,...,...,...,...,...,...,...,...
298820,2019-04-30,1511051984,C013020,티셔츠,[행텐] 남성 5부 포켓 티셔츠 (10170-031-461-05) NC아울렛,19800,NaN,NaN
298821,2019-04-30,2009086191,C012010,여자외의,[크로커다일레이디스][크로커다일레이디] 코트 CL9MCT102_BL (P000577...,129500,NaN,NaN
298822,2019-04-30,348004141,C012010,여자외의,[에꼴][18년 겨울]소매퍼 울코트(C91WCA001Z),383200,NaN,NaN
298823,2019-04-30,539666943,C014010,아동복,[모다아울렛][페리미츠]쿨맥스 옐로우티셔츠 P1825T533,9300,NaN,NaN
298824,2019-04-30,1530685344,L012040,치약,클리오 도라에몽 민트치약 80g x1,3500,3500.0,0.0
298825,2019-04-30,979302868,C013010,점퍼,[모다아울렛][앤듀](앤듀)홑겹 항공점퍼O185Z1001P,49000,NaN,NaN
298826,2019-04-30,1599670444,C021020,구두,[스미스마켓] 모스키노 페이던트 구두 여성구두,77000,NaN,NaN
298827,2019-04-30,780380817,C011040,남자하의,CP컴퍼니 19SS 06CMSS051A 103 렌즈 트레이닝 반바지,185480,NaN,NaN
298828,2019-04-30,817474478,C012010,여자외의,베이직 더블자켓 SV1JK37/ 숲,99500,NaN,NaN
298829,2019-04-30,1123426508,C013020,티셔츠,[캉골][AK분당점][캉골]키치 심볼 티셔츠 2592 네온,52000,NaN,NaN
298830,2019-04-30,966245842,C013020,티셔츠,헤지스골프 남성 블랙 컬러블록 반팔카라티셔츠 HUTS9B316BK/ 헤지스골프,142200,NaN,NaN
298831,2019-04-30,1926058617,C013020,티셔츠,[마인드브릿지]마인드브릿지 CP스판섭섭만세와펜포켓세미오버티셔츠 MTTS3163,39900,NaN,NaN
298832,2019-04-30,1995938056,C011020,남자상의,디스퀘어드2 셔츠(소매데님)프린팅 남방 중고 구제 캐주얼 배색 봄 가을 기본 남성용...,48000,NaN,NaN
298833,2019-04-30,1484669859,C013010,점퍼,[흄(HUM)]W몰 HUM 남여공용 코치자켓 바람막이점퍼 FHMECUV702P,10000,NaN,NaN
298834,2019-04-30,1779929690,C013010,점퍼,남성야상 남성점퍼 남자 야상점퍼 자켓 잠바 바람막이 숏 롱 간절기용 겨울용 탈부착 ...,92980,NaN,NaN
298835,2019-04-30,1485126001,C011020,남자상의,(color : NAVY | size : L_100) 체크 패턴 배색 데님 네이비 ...,37580,NaN,NaN
298836,2019-04-30,329101001,C014010,아동복,[젤리스푼]플라워롱티셔츠상하복,17900,NaN,NaN
298837,2019-04-30,776844370,C012050,여자하의,[오가게/아이우먼]아이우먼 밴딩 롤업 슬림핏진 MD4929M904 빅사이즈/ 아이우먼,46550,NaN,NaN
298838,2019-04-30,921326545,C012050,여자하의,[르샵] 일자핏 허리밴딩 면바지(LJ2PT607),71100,NaN,NaN
298839,2019-04-30,1589175955,C013010,점퍼,[SOUP]뒷판 자수 바람막이 후드 점퍼(SV4UJ90),99000,NaN,NaN
298840,2019-04-30,2006950378,C011040,남자하의,(사이즈 : M) JDP-068 베이직컬 하프팬츠-그레이 남성구제청바지 데님반바지 ...,30420,NaN,NaN
298841,2019-04-30,1734495884,L012060,샴푸,자양윤모 샴푸 샴푸 2종(지성두피용) 머리샴푸 머릿결관리 손상모발샴푸 머릿결샴푸 헤어관리,35620,NaN,NaN
298842,2019-04-30,1927456115,A013090,전복,[남해바다] 전복 1kg(13~15미),65900,65900.0,0.0
298843,2019-04-30,1029223867,C012050,여자하의,(옵션1 : 블랙-1) 804S 줄지 슬림 스커트 DCM1927 여성패션스커트 패션...,33360,NaN,NaN
298844,2019-04-30,1917998337,C013020,티셔츠,(색상 : 흰색 | 사이즈 : FREE) MTS-358 싱포 맨투맨 남성맨투맨티셔츠...,15420,NaN,NaN
298845,2019-04-30,815310680,C014010,아동복,[플레이키즈][플레이키즈프로][130-170] NSW 테크폴리스 여아 후디 (AMF...,89000,NaN,NaN
298846,2019-04-30,1747545991,C012030,여자상의,(더아이잗컬렉션) 프릴끈 장식 블라우스 CJ4A0BL42/ 아이잗컬렉션,169000,NaN,NaN
298847,2019-04-30,672400750,C011020,남자상의,(color : Mblue | size : L_100) 핸리넥 데님 블루 셔츠 _N...,37580,NaN,NaN
298848,2019-04-30,732785486,A019040,소금,함초 자연소금3kg,19100,19100.0,0.0
298849,2019-04-30,2118547344,C013040,청바지,[포에버21]디스트로이드 슬림핏 청바지/FOREVER21/청바지/일자핏,37000,NaN,NaN

In [167]:
df.columns = ['수집일자', '상품ID', '품목ID', '품목명',  '상품명', '판매가격', '할인가격', "혜택가격"]

df.head()
df.describe()

               상품ID          판매가격          할인가격          혜택가격
count  2.988500e+05  2.988500e+05  7.534200e+04  7.534200e+04
mean   1.059928e+09  7.281053e+04  5.565984e+04 -3.165999e+03
std    6.070242e+08  1.875896e+05  1.878616e+05  2.787166e+04
min    5.739000e+03  1.100000e+02  1.000000e+01 -1.863870e+06
25%    5.753720e+08  1.900000e+04  1.080000e+04  0.000000e+00
50%    1.029318e+09  3.491000e+04  2.307400e+04  0.000000e+00
75%    1.597350e+09  6.880000e+04  4.680000e+04  0.000000e+00
max    2.147355e+09  1.683000e+07  1.683000e+07  0.000000e+00

In [172]:
df2 = df[["수집일자", "상품ID","상품명"]]
df2

,수집일자,상품ID,상품명
0,2019-04-30,1545587997,캘빈클라인진 19SS 신상 여성 항공점퍼 J211287
1,2019-04-30,147567876,[모다아울렛][티엔지티]그레이 라운드넥 면 긴팔티셔츠TGTS9A103G2
2,2019-04-30,897756527,간단한 맥주안주 마른 군것질 견과 꿀땅콩 453g 간단
3,2019-04-30,410494691,간장(진 사조 옹가네 1.8L)X8 간장 진간장 식자재 업
4,2019-04-30,223173815,(색상 : 곤색 | 사이즈 : XL) FSSF18036 선염체크 버튼다운 남방 남자...
5,2019-04-30,1173935366,(냉동)금호 쌀떡꼬치900g(10p)x15개(1box) 쌀떡꼬치 튀김류 떡꼬치 가공...
6,2019-04-30,1476779724,[빨질레리] 애쉬 울 블렌드 시어서커 셋업 팬츠 (PC9121UA14)
7,2019-04-30,1847125407,[압소바]라글랑화섬점퍼 AU3-53103
8,2019-04-30,765016470,[에스쏠레지아] 봄의 요정이 살포시 앉은 레이스와 프릴 블라우스_NC엑스코점
9,2019-04-30,1093348192,[한국디비케이(주)] 킬파프 개미에어졸 뿌리는개미살충제 스프레이개미약
10,2019-04-30,2116113448,반에이크 ㄷ밑단커팅면바지 VA93DLM203Z
11,2019-04-30,614125763,(옵션-사이즈 : K2 방한장갑 IMW12901-M) K2 방한장갑 IMW12901...
12,2019-04-30,42902822,[지오지아] 면혼방 프린트 하프팬츠 ABV2PH1105WT/ 지오지아
13,2019-04-30,214930055,[세바스찬골프] 상하 반전 배색 스판 남성 카라넥 반팔티셔츠_243813
14,2019-04-30,384202521,[HP] 잉크 C8775WA (No.02/S라이트마젠타)
15,2019-04-30,1146020498,(옵션1 : 블랙-XL) 810 데일리 폴링 반폴라티 DGO3295 여성빅사이즈티셔...
16,2019-04-30,355123645,흡한속건 소매 메쉬 여성 하프넥 반팔티셔츠/골프웨어_244317
17,2019-04-30,721037017,[MAC]맥 플렌티 오브 파우트 플럼핑 립스틱[갤러리아]
18,2019-04-30,233236126,(색상 : 네이비5호) 아동원피스 벨트 원피스 KIDBOK-266 여아원피스 유아의...
19,2019-04-30,1295113329,[하프클럽/ZIOZIA](지오지아) 면혼방 체크 드레스셔츠 ABV1WC1103YE
20,2019-04-30,1887159474,[나이스크랍][AK구로점][나이스클랍] [18년 겨울]레오파드 스커트 N184PWKB99
21,2019-04-30,619083649,[반에이크]반에이크 블랙 베이직 큐롯팬츠 VA95SLQ304Z (VA95SLQ304Z)
22,2019-04-30,2140496746,[파파브로]남자 국산 스판 카라 패턴 티셔츠 LM-A9-253-그레이
23,2019-04-30,129170450,[오렌지앤] 라임향품은코트_S-2XL(OJK73267)
24,2019-04-30,917251725,다미즐 제주 청귤차 1kg
25,2019-04-30,1723482670,[나이키] (SIZE : 260) 에어 줌 페가수스 35(942851101) 런닝운...
26,2019-04-30,343414417,[하프클럽/매긴]양가죽숏라이더자켓MHDLJ101
27,2019-04-30,1485277833,[진도 Klever] 로얄 세이블 콤비 유색 밍크 코트(K2W3EC53_)
28,2019-04-30,287212559,(색상 : 다홍 | 사이즈 : 110(2XL)) MTSS18095 숄더앤 바스트 포...
29,2019-04-30,1973646101,(옵션 : 105(2XL)) 랜더스 라이트 폴라폴리스 자켓(JK430W) 블루 폴라...
...,...,...,...
298820,2019-04-30,1511051984,[행텐] 남성 5부 포켓 티셔츠 (10170-031-461-05) NC아울렛
298821,2019-04-30,2009086191,[크로커다일레이디스][크로커다일레이디] 코트 CL9MCT102_BL (P000577...
298822,2019-04-30,348004141,[에꼴][18년 겨울]소매퍼 울코트(C91WCA001Z)
298823,2019-04-30,539666943,[모다아울렛][페리미츠]쿨맥스 옐로우티셔츠 P1825T533
298824,2019-04-30,1530685344,클리오 도라에몽 민트치약 80g x1
298825,2019-04-30,979302868,[모다아울렛][앤듀](앤듀)홑겹 항공점퍼O185Z1001P
298826,2019-04-30,1599670444,[스미스마켓] 모스키노 페이던트 구두 여성구두
298827,2019-04-30,780380817,CP컴퍼니 19SS 06CMSS051A 103 렌즈 트레이닝 반바지
298828,2019-04-30,817474478,베이직 더블자켓 SV1JK37/ 숲
298829,2019-04-30,1123426508,[캉골][AK분당점][캉골]키치 심볼 티셔츠 2592 네온
298830,2019-04-30,966245842,헤지스골프 남성 블랙 컬러블록 반팔카라티셔츠 HUTS9B316BK/ 헤지스골프
298831,2019-04-30,1926058617,[마인드브릿지]마인드브릿지 CP스판섭섭만세와펜포켓세미오버티셔츠 MTTS3163
298832,2019-04-30,1995938056,디스퀘어드2 셔츠(소매데님)프린팅 남방 중고 구제 캐주얼 배색 봄 가을 기본 남성용...
298833,2019-04-30,1484669859,[흄(HUM)]W몰 HUM 남여공용 코치자켓 바람막이점퍼 FHMECUV702P
298834,2019-04-30,1779929690,남성야상 남성점퍼 남자 야상점퍼 자켓 잠바 바람막이 숏 롱 간절기용 겨울용 탈부착 ...
298835,2019-04-30,1485126001,(color : NAVY | size : L_100) 체크 패턴 배색 데님 네이비 ...
298836,2019-04-30,329101001,[젤리스푼]플라워롱티셔츠상하복
298837,2019-04-30,776844370,[오가게/아이우먼]아이우먼 밴딩 롤업 슬림핏진 MD4929M904 빅사이즈/ 아이우먼
298838,2019-04-30,921326545,[르샵] 일자핏 허리밴딩 면바지(LJ2PT607)
298839,2019-04-30,1589175955,[SOUP]뒷판 자수 바람막이 후드 점퍼(SV4UJ90)
298840,2019-04-30,2006950378,(사이즈 : M) JDP-068 베이직컬 하프팬츠-그레이 남성구제청바지 데님반바지 ...
298841,2019-04-30,1734495884,자양윤모 샴푸 샴푸 2종(지성두피용) 머리샴푸 머릿결관리 손상모발샴푸 머릿결샴푸 헤어관리
298842,2019-04-30,1927456115,[남해바다] 전복 1kg(13~15미)
298843,2019-04-30,1029223867,(옵션1 : 블랙-1) 804S 줄지 슬림 스커트 DCM1927 여성패션스커트 패션...
298844,2019-04-30,1917998337,(색상 : 흰색 | 사이즈 : FREE) MTS-358 싱포 맨투맨 남성맨투맨티셔츠...
298845,2019-04-30,815310680,[플레이키즈][플레이키즈프로][130-170] NSW 테크폴리스 여아 후디 (AMF...
298846,2019-04-30,1747545991,(더아이잗컬렉션) 프릴끈 장식 블라우스 CJ4A0BL42/ 아이잗컬렉션
298847,2019-04-30,672400750,(color : Mblue | size : L_100) 핸리넥 데님 블루 셔츠 _N...
298848,2019-04-30,732785486,함초 자연소금3kg
298849,2019-04-30,2118547344,[포에버21]디스트로이드 슬림핏 청바지/FOREVER21/청바지/일자핏

In [174]:
df2.to_csv("temp.csv", encoding="cp949")

In [ ]:
df1 = pd.read_csv('temp.csv')
# df1 = pd.read_csv('temp.csv', encoding='utf8') # 사실상 표준 # default
# df1 = pd.read_csv('temp.csv', encoding='cp949') # windows

## Excel 파일

In [ ]:
df2 = pd.read_excel('file.xlsx')

# data type 지정
# df2 = pd.read_excel('tmp.xlsx', index_col=0, dtype={'Name': str, 'Value': float})  # doctest: +SKIP
# 
# na value 지정
# pd.read_excel('tmp.xlsx', index_col=0,
#               na_values=['string1', 'string2'])

In [ ]:
day = "01"
file1 = os.path.join(DATASET_PATH, "2019-04-30.csv")

df = pd.read_csv(file1, error_bad_lines=False, header=None)
df

# 연습문제?

In [176]:
import os
BASE_DIR = os.getcwd()
DATASET_PATH = os.path.join(BASE_DIR, "datasets\\201904")

In [197]:
initial_file = os.path.join(DATASET_PATH, "2019-04-01.csv")

o_df = pd.read_csv(initial_file, header=None, error_bad_lines=False)
o_df.info()

b'Skipping line 36560: expected 8 fields, saw 11\n'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208747 entries, 0 to 208746
Data columns (total 8 columns):
0    208747 non-null object
1    208747 non-null int64
2    208747 non-null object
3    208747 non-null object
4    208747 non-null object
5    208747 non-null int64
6    26633 non-null float64
7    26633 non-null float64
dtypes: float64(2), int64(2), object(4)
memory usage: 12.7+ MB

In [200]:
for x in pd.date_range('2019-04-02', periods=29):
    date = x.strftime('%Y-%m-%d')
    filename = "{}.csv".format(date)
    
    filepath = os.path.join(DATASET_PATH, filename)
    df = pd.read_csv(filepath, header=None, error_bad_lines=False)
    o_df = o_df.append(df)

b'Skipping line 222462: expected 8 fields, saw 11\n'
b'Skipping line 27894: expected 8 fields, saw 11\n'
b'Skipping line 45907: expected 8 fields, saw 11\n'
b'Skipping line 45538: expected 8 fields, saw 11\n'
b'Skipping line 89789: expected 8 fields, saw 11\n'
b'Skipping line 219259: expected 8 fields, saw 11\n'
b'Skipping line 129303: expected 8 fields, saw 11\n'
b'Skipping line 272309: expected 8 fields, saw 11\n'
b'Skipping line 211460: expected 8 fields, saw 11\n'
b'Skipping line 57879: expected 8 fields, saw 11\n'
b'Skipping line 170099: expected 8 fields, saw 11\n'
b'Skipping line 168991: expected 8 fields, saw 11\n'
b'Skipping line 61227: expected 8 fields, saw 11\n'
b'Skipping line 139967: expected 8 fields, saw 11\n'
b'Skipping line 61480: expected 8 fields, saw 11\n'
b'Skipping line 77728: expected 8 fields, saw 11\n'
b'Skipping line 271889: expected 8 fields, saw 11\n'
b'Skipping line 223096: expected 8 fields, saw 11\n'
b'Skipping line 104855: expected 8 fields, saw 11\n'
b'Skipping line 18081: expected 8 fields, saw 11\n'

In [201]:
o_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7972751 entries, 0 to 298849
Data columns (total 8 columns):
0    object
1    int64
2    object
3    object
4    object
5    int64
6    float64
7    float64
dtypes: float64(2), int64(2), object(4)
memory usage: 547.4+ MB

In [206]:
o_df.head()

,0,1,2,3,4,5,6,7
0,2019-04-01,2142932948,C011020,남자상의,(사이즈 : RFCB2021 shirts 110) 슬림핏)링클프리 고급모달 블루 반...,44540,NaN,NaN
1,2019-04-01,1812194343,C013020,티셔츠,폴햄 공용슬럽브이넥반팔티셔츠(차콜) PHZ2TR3840,9900,NaN,NaN
2,2019-04-01,954865871,C014010,아동복,프렌치캣Q92DKJ040 연보라 프릴 바람막이JP,76000,NaN,NaN
3,2019-04-01,853175004,A021010,커피,[맥널티] 아이브루 케냐AA 30T+10T 인스턴트커피믹스 원두커피 케냐AA 인스턴...,16260,NaN,NaN
4,2019-04-01,826899644,A019050,간장,채선해 어간장 세트1(대멸치350g+어간장650ml) 어간장선물세트 실속선물세트 직...,37970,NaN,NaN

In [207]:
o_df.columns = ['수집일자', '상품ID', '품목ID', '품목명',  '상품명', '판매가격', '할인가격', "혜택가격"]
o_df.head()

,수집일자,상품ID,품목ID,품목명,상품명,판매가격,할인가격,혜택가격
0,2019-04-01,2142932948,C011020,남자상의,(사이즈 : RFCB2021 shirts 110) 슬림핏)링클프리 고급모달 블루 반...,44540,NaN,NaN
1,2019-04-01,1812194343,C013020,티셔츠,폴햄 공용슬럽브이넥반팔티셔츠(차콜) PHZ2TR3840,9900,NaN,NaN
2,2019-04-01,954865871,C014010,아동복,프렌치캣Q92DKJ040 연보라 프릴 바람막이JP,76000,NaN,NaN
3,2019-04-01,853175004,A021010,커피,[맥널티] 아이브루 케냐AA 30T+10T 인스턴트커피믹스 원두커피 케냐AA 인스턴...,16260,NaN,NaN
4,2019-04-01,826899644,A019050,간장,채선해 어간장 세트1(대멸치350g+어간장650ml) 어간장선물세트 실속선물세트 직...,37970,NaN,NaN

In [209]:
o_df.to_csv("완성본.csv", encoding="cp949")

In [210]:
if not os.path.exists(DATASET_PATH):
    os.makedirs(DATASET_PATH)

True

In [215]:
df = pd.read_csv("완성본.csv", encoding="cp949", index_col=0)

C:\ProgramData\Anaconda3\lib\site-packages\numpy\lib\arraysetops.py:569: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

In [216]:
df.head()

,수집일자,상품ID,품목ID,품목명,상품명,판매가격,할인가격,혜택가격
0,2019-04-01,2142932948,C011020,남자상의,(사이즈 : RFCB2021 shirts 110) 슬림핏)링클프리 고급모달 블루 반...,44540,NaN,NaN
1,2019-04-01,1812194343,C013020,티셔츠,폴햄 공용슬럽브이넥반팔티셔츠(차콜) PHZ2TR3840,9900,NaN,NaN
2,2019-04-01,954865871,C014010,아동복,프렌치캣Q92DKJ040 연보라 프릴 바람막이JP,76000,NaN,NaN
3,2019-04-01,853175004,A021010,커피,[맥널티] 아이브루 케냐AA 30T+10T 인스턴트커피믹스 원두커피 케냐AA 인스턴...,16260,NaN,NaN
4,2019-04-01,826899644,A019050,간장,채선해 어간장 세트1(대멸치350g+어간장650ml) 어간장선물세트 실속선물세트 직...,37970,NaN,NaN

<function pandas.io.parsers._make_parser_function.<locals>.parser_f(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)>